In [121]:
from datetime import datetime
from dateutil import relativedelta

# two dates

d1='4/8/1885'
d2='30/12/1885'

start_date = datetime.strptime(d1,"%d/%m/%Y")
end_date = datetime.strptime(d2, "%d/%m/%Y")

# Get the relativedelta between two dates
delta = relativedelta.relativedelta(end_date, start_date)
print('Years, Months, Days between two dates is')
print(delta.years, 'Years,', delta.months, 'months,', delta.days, 'days')

Years, Months, Days between two dates is
0 Years, 4 months, 26 days

In [122]:
def td(start, end):
    start_date = datetime.strptime(start,"%d/%m/%Y")
    end_date = datetime.strptime(end, "%d/%m/%Y")

    # Get the relativedelta between two dates
    delta = relativedelta.relativedelta(end_date, start_date)
    s = f'{delta.years} Years, {delta.months} months, {delta.days} days'
    return s
    
z=td(d1,d2)
print(z)

0 Years, 4 months, 26 days

In [123]:
import pandas as pd
louis=pd.DataFrame(
[['Fort Riley KS','4/8/1885','30/12/1885'],
 ['Fort Yates DT','31/12/1885','16/10/1886'],
 ['Fort Mead DT','17/10/1886', '16/7/1888'],
 ['Fort Riley KS','17/7/1888', '26/7/1890'],
 ['Civilian',    '27/7/1890',  '20/1/1891'],
 ['Fort Sheridan IL', '9/10/1892','19/4/1894'],
],
columns=['Fort','StartDate',"EndDate"]
)
display(louis)

               Fort   StartDate     EndDate
0     Fort Riley KS    4/8/1885  30/12/1885
1     Fort Yates DT  31/12/1885  16/10/1886
2      Fort Mead DT  17/10/1886   16/7/1888
3     Fort Riley KS   17/7/1888   26/7/1890
4          Civilian   27/7/1890   20/1/1891
5  Fort Sheridan IL   9/10/1892   19/4/1894

In [124]:
#
# Vectorize is an interesting approach
#
import numpy as np

louis['Duration'] = np.vectorize(td)(louis['StartDate'], louis['EndDate'])
print(louis)

               Fort   StartDate     EndDate                    Duration
0     Fort Riley KS    4/8/1885  30/12/1885  0 Years, 4 months, 26 days
1     Fort Yates DT  31/12/1885  16/10/1886  0 Years, 9 months, 16 days
2      Fort Mead DT  17/10/1886   16/7/1888  1 Years, 8 months, 29 days
3     Fort Riley KS   17/7/1888   26/7/1890   2 Years, 0 months, 9 days
4          Civilian   27/7/1890   20/1/1891  0 Years, 5 months, 24 days
5  Fort Sheridan IL   9/10/1892   19/4/1894  1 Years, 6 months, 10 days

In [125]:
louis.drop(['Duration'], axis=1)

               Fort   StartDate     EndDate
0     Fort Riley KS    4/8/1885  30/12/1885
1     Fort Yates DT  31/12/1885  16/10/1886
2      Fort Mead DT  17/10/1886   16/7/1888
3     Fort Riley KS   17/7/1888   26/7/1890
4          Civilian   27/7/1890   20/1/1891
5  Fort Sheridan IL   9/10/1892   19/4/1894

In [126]:

louis.Duration=louis.apply(lambda x: td(x.StartDate,x.EndDate),axis=1)
display(louis)

               Fort   StartDate     EndDate                    Duration
0     Fort Riley KS    4/8/1885  30/12/1885  0 Years, 4 months, 26 days
1     Fort Yates DT  31/12/1885  16/10/1886  0 Years, 9 months, 16 days
2      Fort Mead DT  17/10/1886   16/7/1888  1 Years, 8 months, 29 days
3     Fort Riley KS   17/7/1888   26/7/1890   2 Years, 0 months, 9 days
4          Civilian   27/7/1890   20/1/1891  0 Years, 5 months, 24 days
5  Fort Sheridan IL   9/10/1892   19/4/1894  1 Years, 6 months, 10 days

In [127]:
louis.drop(['Duration'], axis=1)

               Fort   StartDate     EndDate
0     Fort Riley KS    4/8/1885  30/12/1885
1     Fort Yates DT  31/12/1885  16/10/1886
2      Fort Mead DT  17/10/1886   16/7/1888
3     Fort Riley KS   17/7/1888   26/7/1890
4          Civilian   27/7/1890   20/1/1891
5  Fort Sheridan IL   9/10/1892   19/4/1894

In [128]:
#
# Apply as used here worked row by row
#
def td1(row):
    start_date = datetime.strptime(row.StartDate,"%d/%m/%Y")
    end_date = datetime.strptime(row.EndDate, "%d/%m/%Y")

    # Get the relativedelta between two dates
    delta = relativedelta.relativedelta(end_date, start_date)
    s = f'{delta.years} Years, {delta.months} months, {delta.days} days'
    return s

louis.Duration=louis.apply(td1,axis=1)
display(louis)

               Fort   StartDate     EndDate                    Duration
0     Fort Riley KS    4/8/1885  30/12/1885  0 Years, 4 months, 26 days
1     Fort Yates DT  31/12/1885  16/10/1886  0 Years, 9 months, 16 days
2      Fort Mead DT  17/10/1886   16/7/1888  1 Years, 8 months, 29 days
3     Fort Riley KS   17/7/1888   26/7/1890   2 Years, 0 months, 9 days
4          Civilian   27/7/1890   20/1/1891  0 Years, 5 months, 24 days
5  Fort Sheridan IL   9/10/1892   19/4/1894  1 Years, 6 months, 10 days

In [129]:
#
# The pipe command just passes back a whole dataframe
#
def td2(x):
    x.Duration=x.apply(td1,axis=1)
    return(x)

louis.pipe(td2)

               Fort   StartDate     EndDate                    Duration
0     Fort Riley KS    4/8/1885  30/12/1885  0 Years, 4 months, 26 days
1     Fort Yates DT  31/12/1885  16/10/1886  0 Years, 9 months, 16 days
2      Fort Mead DT  17/10/1886   16/7/1888  1 Years, 8 months, 29 days
3     Fort Riley KS   17/7/1888   26/7/1890   2 Years, 0 months, 9 days
4          Civilian   27/7/1890   20/1/1891  0 Years, 5 months, 24 days
5  Fort Sheridan IL   9/10/1892   19/4/1894  1 Years, 6 months, 10 days

apply works on a row / column basis of a DataFrame
applymap works element-wise on a DataFrame
map works element-wise on a Series

How can I apply map and applymap?